import { Component, OnInit } from '@angular/core';
import { DocxDocument } from "../../utils/docx-models";
import { DocxParser } from "../../utils/docx-parser";
import { TestEdit } from "../../admin/components/edit-test-conf/edit-test-conf.component";

@Component({
  selector: 'app-docx4js-test',
  templateUrl: './docx4js-test.component.html',
  styleUrls: ['./docx4js-test.component.css']
})
export class Docx4jsTestComponent implements OnInit {

  editableTests: TestEdit[] = [];

  emptyTest: TestEdit = new TestEdit();

  constructor() {
  }

  ngOnInit() {
    this.editableTests = Docx4jsTestComponent.tests.map((t, i) => TestEdit.fromSimple(1, i + 1, t));
  }

  saveTest(test: TestEdit) {
    console.log(test)
  }

  fileAdded = (file: File) => {
    console.log(file.name);
    DocxParser.loadFileAndParseOutTests(file).then(tests => {
      this.editableTests = tests.map((t, i) => TestEdit.fromSimple(1, i + 1, t));
      console.log(JSON.stringify(tests));
    })
  };

  trackTest(index, test: TestEdit) {
    return test ? test.id : undefined;
  }

  static tests = [{
    "question": "За кольоросприйняття відповідають:",
    "options": ["палички", "зоровий нерв", "зіниця", "колбочки", "хоріоідеа"]
  }, {
    "question": "Яка гострота зору, якщо хворий рахує пальці на віддалі 2м?",
    "options": ["гострота зору = 0,04", "гострота зору = 0,1", "гострота зору = 0,02", "гострота зору = 0,4", "гострота зору = 0,2"]
  }, {
    "question": "Назвіть суб’єктивні методи дослідження рефракції ока:",
    "options": ["рефрактометрія, скіаскопія", "скіаскопія", "визначення найдальшої крапки ясного зору", "підбір коригуючих лінз з перевіркою гостроти зору по таблицях", "кератометрія з допомогою офтальмометра"]
  }, {
    "question": "Донизу і до носу очне яблуко повертає м’яз:",
    "options": ["верхній косий", "нижній прямий", "нижній косий", "верхній прямий", "внутрішній прямий"]
  }, {
    "question": "Гострота зору це:",
    "options": ["простір, що сприймається оком при відсутності руху очима і головою", "здатність бачити на різній відстані", "показник заломлення рогівки", "показник центрального зору", "здатність бачити одночасно обома очима"]
  }, {
    "question": "Акомодація  це:",
    "options": ["здатність змінювати силу заломлення і бачити добре здалека і зблизька", "здатність оптичної системи заломлювати світло", "здатність бачити за умови різного ступеня освітленості", "здатність розрізняти кольори", "здатність бачити обома очима одночасно"]
  }, {
    "question": "Що таке ентропіон?",
    "options": ["виворіт повіки", "заворот повіки", "неправильний ріст вій", "відсутній ріст вій", "опущення верхньої повіки"]
  }, {
    "question": "Найкращий результат в лікуванні дакріоциститу новонароджених забезпечує:",
    "options": ["масаж в ділянці слізного мішка", "промивання слізних шляхів", "інстиляції дезінфікуючих крапель", "зондування носо-слізної протоки", "закладання мазі в кон’юнктивальний мішок"]
  }, {
    "question": "Для профілактики гонобленореї новонароджених використовують:",
    "options": ["20% розчин сульфацилу натрію", "10% розчин лідокаїну", "0,25% розчин левоміцетину", "1% розчин пілокарпіну", "0,3% розчин флоксалу"]
  }, {
    "question": "Найслабшою стінкою орбіти є:",
    "options": ["внутрішня", "нижня", "задня", "зовнішня", "верхня"]
  }, {
    "question": "Кліпання ока відбувається при скороченні м’язу:",
    "options": ["підіймача верхньої повіки", "колового", "нижнього прямого", "верхнього прямого", "верхнього косого"]
  }, {
    "question": "Для якого захворювання характерний симптомокомплекс: біль в оці, світлобоязнь, сльозотеча, перикорнеальна ін’єкція, наявність інфільтрату на рогівці?",
    "options": ["склерит", "кератит", "іридоцикліт", "хоріоідит", "кон’юнктивіт"]
  }, {
    "question": "Наявність гнійного вмісту в передній камері ока називається:",
    "options": ["гіфема", "гемофтальм", "фліктена", "гіпопіон", "преципітат"]
  }, {
    "question": "Ретробульбарний неврит це:",
    "options": ["запалення передньої частини зорового нерва", "запалення сітківки", "запалення судинної оболонки", "запалення фіброзної оболонки", "запалення задньої частини зорового нерва"]
  }, {
    "question": "Місце утворення в оці водянистої вологи:",
    "options": ["війкове тіло", "склисте тіло", "кут передньої камери", "кришталик", "рогівка"]
  }, {
    "question": "Протипоказанням для промивання очей являється:",
    "options": ["електроофтальмія", "хімічний опік очей", "проникне поранення ока", "гострий кон’юнктивіт", "гострий дакріоцистит"]
  }, {
    "question": "Поле зору це:",
    "options": ["здатність бачити на різній відстані", "простір, що сприймається оком при відсутності руху очима і головою", "показник центрального зору", "показник заломлення рогівки", "здатність бачити одночасно обома очима"]
  }, {
    "question": "Гемофтальм це:",
    "options": ["крововилив в склисте тіло", "крововилив в передню камеру", "крововилив в кришталик", "крововилив в сітківку", "крововилив під кон’юнктиву"]
  }, {
    "question": "Основна функція сітківки:",
    "options": ["заломлююче середовище", "продукує поживні речовини", "забезпечує фотохімічні процеси", "забезпечує перший етап акту зору", "продукує внутрішньоочну рідину"]
  }, {
    "question": "Який клінічний стан супроводжується емфіземою повік?",
    "options": ["флегмона орбіти", "важка травма повіки", "порушення цілісності верхньої стінки орбіти", "порушення цілісності стінки орбіти, яка межує з додатковими пазухами носа", "порушення цілісності зовнішньої стінки орбіти"]
  }, {
    "question": "Флегмона орбіти це:",
    "options": ["запалення судинної оболонки", "гнійне запалення ретробульбарної жирової клітковини", "запалення слизової оболонки", "запалення сітківки", "гнійне запалення мейбомієвої залози"]
  }, {
    "question": "Істинний (дійсний) внутрішньоочний тиск у нормі становить:",
    "options": ["15-18 мм рт ст", "18-21 мм рт ст", "18-26 мм рт ст", "26-32 мм рт ст", "32-36 мм рт ст"]
  }, {
    "question": "Наявність фліктени є ознакою:",
    "options": ["сифілітичного кератиту", "герпетичного кератиту", "вірусного кон’юнктивіту", "туберкульозно-алергічного кератиту", "алергічного кон’юнктивіту"]
  }, {
    "question": "Які прилади призначені для визначення поля зору ?",
    "options": ["щілинна лампа, електричний офтальмоскоп", "скіаскопічні лінійки", "бінокулярний офтальмоскоп", "тонометр Маклакова", "периметр настільний, периметр електричний проекційний реєструючий"]
  }, {
    "question": "Які основні симптоми захворювань орбіти?",
    "options": ["екзофтальм + обмеження рухів очного яблука", "екзофтальм", "енофтальм + обмеження рухів очного яблука", "бічне зміщення очного яблука", "крововиливи"]
  }, {
    "question": "Що таке ністагм?",
    "options": ["некоординовані рухи очей", "відсутність рухів очей", "мимовільні рухи очей", "відхилення очей до носу", "відхилення очей до скроні"]
  }, {
    "question": "Найбільш інформативний метод огляду кришталика?",
    "options": ["пряма офтальмоскопія", "біомікроскопія", "тонометрія", "гоніоскопія", "бічне освітлення"]
  }, {
    "question": "Назвіть навантажувальні діагностичні проби глаукоми:",
    "options": ["теплова", "холодова", "темнова", "світлова", "коларголова"]
  }, {
    "question": "Профілактика симпатичного запалення:",
    "options": ["показана евісцерація ураженого ока", "своєчасна первинна обробка рани", "призначення загальної протизапальної і десенсибілізуючої терапії", "місцево призначення антибіотиків і кортикостероїдів", "своєчасна енуклеація ураженого ока"]
  }, {
    "question": "Кольоровідчуття визначають за допомогою:",
    "options": ["оптотипів", "адаптометра", "тонометра", "поліхроматичних таблиць", "периметра"]
  }, {
    "question": "Назвіть функції війкового тіла:",
    "options": ["забезпечує кольоровідчуття", "регулює світловідчуття", "продукція внутрішньоочної рідини", "забезпечує центральний зір", "регуляція потоку світла на сітківку"]
  }, {
    "question": "В якому віці краще проводити зондування слізних шляхів при дакріоциститі новонароджених?",
    "options": ["2-3 місяці", "в перший місяць після народження", "3 місяці – 1 рік", "6 місяців", "1 рік"]
  }, {
    "question": "Для визначення прохідності слізних шляхів проводять:",
    "options": ["коларголову пробу", "флюоресцеїнову пробу", "зондування носо-слізної протоки", "темнову пробу", "пілокарпінову пробу"]
  }, {
    "question": "Що таке скотома?",
    "options": ["звуження поля зору", "іскри перед очима", "тимчасова втрата зору", "випадіння з поля зору", "райдужні кола перед очима"]
  }, {
    "question": "Через зоровий отвір в орбіту входить:",
    "options": ["верхньощелеповий нерв", "гілка трійчастого нерва", "зоровий нерв", "орбітальна артерія", "блоковидний нерв"]
  }, {
    "question": "Найбільш типові ознаки простого блефариту?",
    "options": ["гіперемія та інфільтрація краю повік", "виразки з гнійними кірочками на краю повік", "пінисті виділення біля кута ока і краю повік", "білі лусочки біля коренів вій", "склеювання повік після сну"]
  }, {
    "question": "Кровопостачання очного яблука та придатків ока відбувається через:",
    "options": ["довгі війчасті артерії", "центральну артерію сітківки", "лицеву артерію", "слізну артерію", "очну артерію"]
  }, {
    "question": "Яка ін’єкція очного яблука спостерігається при кератитах:",
    "options": ["перикорнеальна, іноді кон’юнктивальна", "кон’юнктивальна, іноді перикорнеальна", "без ін’єкції", "перикорнеальна, іноді змішана", "тільки кон’юнктивальна"]
  }, {
    "question": "Збільшення розмірів рогівки є ознакою:",
    "options": ["кератиту", "катаракти", "більма рогівки", "вродженої глаукоми", "іридоцикліту"]
  }, {
    "question": "Які з перерахованих очних крапель знижують ВОТ:",
    "options": ["пілокарпін 1% р-н", "атропіну сульфат 1% р-н", "дексаметазон 0,1% р-н", "флоксал 0,3% р-н", "сульфацил натрію 30% р-н"]
  }, {
    "question": "Перша долікарська допомога при травмах ока:",
    "options": ["інстиляція кортикостероїдних засобів", "вправлення випавших оболонок ока", "асептична пов’язка на око, введення протиправцевої сироватки", "відправити до окуліста", "інстиляція антибактеріальних крапель, асептична пов’язка, введення протиправцевої сироватки"]
  }, {
    "question": "Де знаходиться фокус променів у разі еметропії?",
    "options": ["перед сітківкою", "на рогівці", "за сітківкою", "в передній камері", "на сітківці"]
  }, {
    "question": "Вторинна глаукома може виникнути після:",
    "options": ["іридоцикліту", "первинної глаукоми", "кон’юнктивіту", "птеригіума", "кератиту"]
  }, {
    "question": "Випинання очного яблука називається:",
    "options": ["енофтальм", "гідрофтальм", "буфтальм", "гемофтальм", "екзофтальм"]
  }, {
    "question": "Який із методів лікування халязіона найчастіше всього призводить до позитивного результату?",
    "options": ["теплі компреси по15-20 хв. 4 рази", "антибіотики місцево", "хірургічне втручання із видаленням вмісту і капсули", "легкий масаж ділянки випинання повіки", "ін’єкція кортикостероїдів в порожнину халязіона"]
  }, {
    "question": "Який із перерахованих засобів найбільше проникає у вологу передньої камери після опіку?",
    "options": ["нашатирний спирт", "сірчана кислота", "соляна кислота", "розтоплене олово", "всі перераховані"]
  }, {
    "question": "Ким може працювати кольороаномал?",
    "options": ["машиністом поїзда", "учителем", "водієм автомобіля", "автогонщиком", "водієм тролейбуса"]
  }, {
    "question": "Які опіки мають найважчий перебіг?",
    "options": ["термічні", "кислотами", "аніліновим барвником", "ультрафіолетовим промінням", "лугами"]
  }, {
    "question": "Який стан зіниці при гострому іридоцикліті?",
    "options": ["не змінюється", "зіниця вузька", "зіниця розширена", "зіниця щілиноподібна", "зіниця овальна"]
  }, {
    "question": "Загальні принципи лікування гострих кон’юнктивітів:",
    "options": ["промивання кон’юнктивальної порожнини + часті інстиляції + закладання мазі", "субкон’юнктивальні ін’єкції + накладання пов’язки", "накладання повязки + закладання мазі", "закладання мазі", "часті промивання кон’юнктивальної порожнини"]
  }, {
    "question": "Ознаки паралітичної косоокості:",
    "options": ["амбліопія", "диплопія, обмеження рухів, нерівність кутів первинного і вторинного відхилення", "диплопія", "обмеження рухів очного яблука", "диплопія, обмеження рухів, рівність кутів первинного і вторинного відхилення"]
  }, {
    "question": "Гіперметропія коригується?",
    "options": ["найменшою позитивною лінзою, при якій гострота зору 1,0", "найменшою негативною лінзою, при якій гострота зору 1,0", "найбільшою негативною лінзою, при якій гострота зору 1,0", "найбільшою позитивною лінзою, при якій гострота зору 1,0", "найбільшою циліндричною лінзою, при якій гострота зору 1,0"]
  }, {
    "question": "Бінокулярний зір це:",
    "options": ["здатність бачити одночасно обома очима", "простір,що сприймається оком при відсутності руху очима і головою", "здатність бачити на різній відстані", "показник центрального зору", "показник заломлення рогівки"]
  }, {
    "question": "Що таке халязіон?",
    "options": ["гостре запалення сальної залози", "гостре запалення мейбомієвої залози", "хронічне запалення мейбомієвої залози", "виворіт повіки", "заворіт повіки"]
  }, {
    "question": "Преципітати – це:",
    "options": ["гній в передній камері ока", "помутніння скловидного тіла", "осідання в передній камері ока елементів крові", "точкові помутніння на передній поверхні рогівки", "точкові відкладення на задній поверхні рогівки"]
  }, {
    "question": "Гострий напад глаукоми слід диференціювати з:",
    "options": ["гострим кон’юнктивітом", "гострим іридоциклітом", "відшаруванням сітківки", "кератитом", "хоріоретинітом"]
  }, {
    "question": "З якої відстані пацієнт читає перший ряд таблиці Головіна – Сивцева, якщо його гострота зору дорівнює 0,08 ?",
    "options": ["з відстані 0,5 м", "з відстані 4 м", "з відстані 5 м", "з відстані 1 м", "з відстані 3 м"]
  }, {
    "question": "Який із перерахованих препаратів не розширює зіницю?",
    "options": ["адреналіну гідрохлорид 0,1%", "мезатон 1%", "атропіну сульфат 1%", "мідріацил 1%", "дикаїн 0,25%"]
  }, {
    "question": "Глаукома це:",
    "options": ["підвищення внутрішньоочного тиску з атрофією зорового нерву", "аномалія рефракції", "захворювання судинної оболонки та сітківки", "зниження внутрішньоочного тиску з субатрофією очного яблука", "підвищення внутрішньочерепного тиску з застійним диском зорового нерва"]
  }, {
    "question": "Пресбіопія – це порушення:",
    "options": ["рефракції", "зору на кольори", "акомодації", "сутінкового зору", "бінокулярного зору"]
  }, {
    "question": "Яка ознака не характерна для флегмони орбіти?",
    "options": ["гнійні виділення", "екзофтальм", "різке зниження зору", "офтальмоплегія", "хемоз кон’юнктиви"]
  }, {
    "question": "Яким методом можна дослідити кут передньої камери:",
    "options": ["УЗД ока", "біомікроофтальмоскопією", "кампіметрією", "офтальмоскопією", "гоніоскопією"]
  }, {
    "question": "Вимірювання офтальмотонусу називають:",
    "options": ["тонометрія", "периметрія", "рефрактометрія", "гоніоскопія", "скіаскопія"]
  }, {
    "question": "Ускладнення хронічного дакріоциститу:",
    "options": ["повзуча виразка рогівки", "панофтальміт", "флегмона слізного мішка", "гострий кон’юнктивіт", "гнійний менінгіт"]
  }, {
    "question": "Кріотерапія це:",
    "options": ["введення ліків за допомогою електричного струму", "лікування холодом", "теплові процедури", "дія магнітного поля", "дія високопотужних когерентних світлових променів"]
  }, {
    "question": "Міопія коригується?",
    "options": ["найменшою негативною лінзою, при якій гострота зору 1,0", "найменшою позитивною лінзою, при якій гострота зору 1,0", "найбільшою позитивною лінзою, при якій гострота зору 1,0", "найбільшою негативною лінзою, при якій гострота зору 1,0", "найбільшою циліндричною лінзою, при якій гострота зору 1,0"]
  }, {
    "question": "Корекція астигматизму здійснюється:",
    "options": ["сферичними лінзами", "призматичними лінзами", "циліндричними лінзами", "сферопризматичними лінзами", "світлофільтрами"]
  }, {
    "question": "Наявність крові в передній камері ока називається:",
    "options": ["гіфема", "гемофтальм", "гематома", "гіпопіон", "преципітат"]
  }, {
    "question": "Глаукома є протипоказанням для призначення очних крапель:",
    "options": ["дикаїну 1%", "пілокарпіну 1%", "тауфону 4%", "атропіну сульфату 1%", "тимололу 0,5%"]
  }, {
    "question": "З якої відстані проводиться визначення гостроти зору?",
    "options": ["з відстані 1,5 м від таблиці", "з відстані 5 м від таблиці", "з відстані 6 м від таблиці", "з відстані 3 м від таблиці", "з відстані 2,5 м від таблиці"]
  }, {
    "question": "Ускладнення перезрілої катаракти:",
    "options": ["розрив капсули кришталика", "гіфема", "рецидивуючий кератит", "преципітати", "гоніосинехії"]
  }, {
    "question": "Чому в кришталику ніколи не виникає запалення?",
    "options": ["до складу входить білок", "оптичне середовище", "відсутні судини та нерви", "має форму двовипуклої лінзи", "щільно-еластичний"]
  }, {
    "question": "Рефракція це:",
    "options": ["здатність змінювати силу заломлення і бачити добре здалека і зблизька", "здатність бачити за умови різного ступеня освітленості", "здатність розрізняти кольори", "здатність бачити обома очима одночасно", "здатність оптичної системи заломлювати світло"]
  }, {
    "question": "Достовірною ознакою проникаючого поранення  ока є:",
    "options": ["гіпотонія ока", "наявність наскрізної рани", "мілка передня камера", "відсутня передня камера", "глибока передня камера"]
  }, {
    "question": "Як називається аномалія райдужки, яка обумовлена відсутністю в ній пігменту?",
    "options": ["гіпохромія", "гетерохромія", "дисплазія", "атрофія райдужної оболонки", "альбінізм"]
  }, {
    "question": "Яка з цих проб використовується для візуалізації дефекту епітелію рогівки?",
    "options": ["фарбування коларголом", "фарбування флюоресцеїном", "фарбування метиленовим синім", "фарбування бенгальським рожевим", "фарбування вітамінними краплями"]
  }, {
    "question": "Де знаходиться фокус променів у разі короткозорості:",
    "options": ["на сітківці", "на рогівці", "за сітківкою", "перед сітківкою", "в передній камері"]
  }, {
    "question": "Вкажіть положення найдальшої крапки ясного зору у еметропів:",
    "options": ["в нескінченності", "на певній відстані перед оком", "позаду ока у від’ємному просторі", "на сітківці", "на рогівці"]
  }, {
    "question": "Достовірні ознаки гострого іридоцикліту:",
    "options": ["кон’юнктивальна ін’єкція", "задні синехії, міоз, преципітати", "мідріаз", "виділення з кон’юнктивального мішка", "відчуття стороннього тіла"]
  }, {
    "question": "Як досліджувати гостроту зору у дітей 3 - 5 років?",
    "options": ["по таблиці Головіна – Сивцева", "за допомогою офтальмоскопа", "за допомогою гоніоскопа", "по таблицях Орлової", "за допомогою бінокулярного офтальмоскопа"]
  }]

}


